{
  "comments": [
    {
      "id": "cef8",
      "newsId": "1",
      "text": "this is the biggest pile of poopy that ive ever seen. i hate peace, and so does my mom. punch a frog and be happy",
      "vote": "false",
      "createdAt": "2025-08-23T04:57:32.319Z"
    },
    {
      "id": "bf81",
      "newsId": "1",
      "text": "very poopy",
      "vote": "false",
      "createdAt": "2025-08-24T06:22:26.180Z"
    }
  ],
  "news": [
    {
      "id": "1",
      "topic": "International Peace Summit Brings World Leaders Together",
      "short_detail": "World leaders gathered for a peace summit to discuss conflict resolution strategies.",
      "long_detail": "World leaders gathered this week for an International Peace Summit aimed at fostering dialogue and reducing global tensions. Delegations from over 40 nations discussed strategies for conflict resolution, humanitarian aid, and sustainable development. The summit concluded with a joint declaration emphasizing the need for diplomacy and cooperation in addressing both regional disputes and global challenges such as climate change and food security.",
      "trueVotes": 131,
      "falseVotes": 41,
      "reporter": "James Smith",
      "date": "2025-08-10",
      "time": "19:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "2",
      "topic": "Wildfire Spreads Through Northern Region",
      "short_detail": "Firefighters are working around the clock to contain the northern wildfire.",
      "long_detail": "Firefighters are battling a massive wildfire that broke out in the northern region yesterday afternoon. The blaze, fueled by high winds and dry conditions, has already scorched thousands of hectares of forest and forced hundreds of residents to evacuate nearby towns. Emergency services have deployed additional crews and aerial water drops, while officials urge residents to stay alert and follow evacuation orders.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Olivia Brown",
      "date": "2025-08-13",
      "time": "23:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "3",
      "topic": "Severe Weather Alert Issued for Coastal Areas",
      "short_detail": "Residents were urged to prepare for potential flooding after weather alerts.",
      "long_detail": "Meteorological authorities have issued a severe weather alert for coastal areas as heavy rainfall, strong winds, and potential flooding are forecast over the next 48 hours. Residents are advised to secure property, avoid unnecessary travel, and prepare emergency supplies. Local governments have set up evacuation centers in low-lying zones as a precaution.",
      "trueVotes": 1,
      "falseVotes": 2,
      "reporter": "Emma Wilson",
      "date": "2025-08-12",
      "time": "07:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "4",
      "topic": "Celebrity Charity Event Raises Millions for Children’s Health",
      "short_detail": "Stars came together at a charity event to support education initiatives.",
      "long_detail": "A star-studded charity gala held last night raised over $5 million to support children’s healthcare programs worldwide. Celebrities from film, music, and sports joined forces to auction memorabilia, host performances, and raise awareness about medical access for underprivileged youth. Organizers said the funds will go directly toward building pediatric clinics and providing essential treatments.",
      "trueVotes": 1,
      "falseVotes": 1,
      "reporter": "Maria Lopez",
      "date": "2025-08-13",
      "time": "00:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "5",
      "topic": "Global Stock Markets Rally Amid Economic Optimism",
      "short_detail": "Markets rallied following positive economic outlook reports.",
      "long_detail": "Markets worldwide saw a significant rally today as investor confidence surged following positive economic data and central bank assurances. The Dow Jones, FTSE 100, and Nikkei all closed higher, while tech stocks led the charge. Analysts attribute the gains to easing inflation concerns and stronger-than-expected corporate earnings, though they caution that volatility may return if global trade tensions resurface.",
      "trueVotes": 0,
      "falseVotes": 1,
      "reporter": "Liam Wong",
      "date": "2025-08-08",
      "time": "20:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "6",
      "topic": "Cultural Festival Kicks Off With Colorful Parade",
      "short_detail": "The annual cultural festival kicked off with vibrant performances and food stalls.",
      "long_detail": "The annual cultural festival opened today with a vibrant parade featuring traditional costumes, music, and dance from around the world. Thousands of visitors lined the streets to witness performances celebrating diversity and heritage. The week-long festival will include art exhibitions, culinary showcases, and workshops, drawing both locals and international tourists.",
      "trueVotes": 0,
      "falseVotes": 0,
      "reporter": "Maria Lopez",
      "date": "2025-08-15",
      "time": "04:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "7",
      "topic": "Weather Alert Issued as Storm Approaches Inland Cities",
      "short_detail": "Residents were urged to prepare for potential flooding after weather alerts.",
      "long_detail": "A new weather warning has been issued as a tropical storm moves inland, threatening several major cities with torrential rain and strong gusts. Authorities have activated emergency response teams and are monitoring river levels for possible flooding. Residents are urged to stay indoors and remain updated through official channels.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Emma Wilson",
      "date": "2025-08-13",
      "time": "18:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "8",
      "topic": "Education Reform Bill",
      "short_detail": "The education reform bill has sparked protests among teachers.",
      "long_detail": "The proposed education reform bill has ignited widespread protests among teachers and education advocates. Critics argue that the bill undermines public education funding and places undue pressure on teachers. Supporters claim it introduces necessary changes to improve educational outcomes. The debate continues as lawmakers prepare for a crucial vote.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Olivia Brown",
      "date": "2025-08-16",
      "time": "09:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "9",
      "topic": "Tourism Boost",
      "short_detail": "New government policies aim to attract more international tourists.",
      "long_detail": "In an effort to boost the economy, the government has introduced new policies designed to attract international tourists. These include streamlined visa processes, increased marketing efforts in key markets, and incentives for airlines to increase flights to the country. Officials believe that by making it easier for tourists to visit, they can significantly increase tourism revenue and create jobs.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Alex Johnson",
      "date": "2025-08-13",
      "time": "23:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "10",
      "topic": "Global Climate Agreement",
      "short_detail": "Negotiations at the climate summit ended with a historic accord.",
      "long_detail": "The climate summit brought together world leaders to discuss and negotiate measures to combat climate change. After intense discussions, a historic accord was reached, committing nations to more aggressive targets for reducing carbon emissions and investing in renewable energy sources.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Emma Wilson",
      "date": "2025-08-11",
      "time": "09:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "11",
      "topic": "Health Advisory Issued",
      "short_detail": "Health officials issued an advisory following a sharp rise in seasonal flu cases.",
      "long_detail": "Health officials are urging the public to take precautions as seasonal flu cases have surged in recent weeks. The advisory includes recommendations for vaccination, hand hygiene, and staying home when ill.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Olivia Brown",
      "date": "2025-08-11",
      "time": "13:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "12",
      "topic": "New Public Transportation Line",
      "short_detail": "The city opened a new metro line aimed at reducing traffic congestion.",
      "long_detail": "The new metro line is expected to significantly reduce traffic congestion in the city by providing an efficient alternative to car travel. Officials hope that it will encourage more residents to use public transportation.",
      "trueVotes": 0,
      "falseVotes": 1,
      "reporter": "Maria Lopez",
      "date": "2025-08-11",
      "time": "22:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "13",
      "topic": "Health Advisory Issued",
      "short_detail": "Health officials issued an advisory following a sharp rise in seasonal flu cases.",
      "long_detail": "Health officials are urging the public to take precautions as seasonal flu cases have surged in recent weeks. The advisory includes recommendations for vaccination, hand hygiene, and staying home when ill.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Sophie Chen",
      "date": "2025-08-14",
      "time": "12:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "14",
      "topic": "Wildfire in Northern Region",
      "short_detail": "The wildfire has burned thousands of acres, threatening nearby towns.",
      "long_detail": "The wildfire in the northern region has rapidly spread, fueled by dry conditions and strong winds. Firefighters are working around the clock to contain the blaze, which has already destroyed several homes and forced evacuations.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Sophie Chen",
      "date": "2025-08-14",
      "time": "05:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "15",
      "topic": "Stock Market Rally",
      "short_detail": "Markets rallied following positive economic outlook reports.",
      "long_detail": "In response to a series of positive economic indicators, stock markets experienced a significant rally today. Analysts attribute this surge to improved consumer confidence and strong corporate earnings reports. Investors are optimistic about the potential for continued growth in the coming quarters.",
      "trueVotes": 0,
      "falseVotes": 0,
      "reporter": "Ethan Carter",
      "date": "2025-08-14",
      "time": "01:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "16",
      "topic": "Cultural Festival Begins",
      "short_detail": "Traditional dances and parades marked the beginning of the cultural festival.",
      "long_detail": "The cultural festival kicked off with vibrant traditional dances and colorful parades, showcasing the rich heritage and diversity of the community. Local artists and performers took center stage, captivating audiences with their talent and creativity.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Liam Wong",
      "date": "2025-08-12",
      "time": "17:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "17",
      "topic": "Weather Alert Issued",
      "short_detail": "Residents were urged to prepare for potential flooding after weather alerts.",
      "long_detail": "Residents are being urged to prepare for potential flooding as weather alerts have been issued for the area. Authorities recommend securing property and having an emergency kit ready.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Sophie Chen",
      "date": "2025-08-11",
      "time": "09:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "18",
      "topic": "Education Reform Bill",
      "short_detail": "Debates continue in parliament over the proposed education reform.",
      "long_detail": "The proposed education reform bill aims to address key issues in the current education system, including funding, curriculum changes, and teacher training. Supporters argue that the reforms are necessary to improve educational outcomes, while opponents raise concerns about potential drawbacks.",
      "trueVotes": 0,
      "falseVotes": 0,
      "reporter": "James Smith",
      "date": "2025-08-16",
      "time": "02:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "19",
      "topic": "Health Advisory Issued",
      "short_detail": "A health advisory was issued due to poor air quality in urban areas.",
      "long_detail": "Health officials are urging the public to take precautions as seasonal flu cases have surged in recent weeks. The advisory includes recommendations for vaccination, hand hygiene, and staying home when ill.",
      "trueVotes": 0,
      "falseVotes": 0,
      "reporter": "Olivia Brown",
      "date": "2025-08-11",
      "time": "02:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    },
    {
      "id": "20",
      "topic": "Political Debate Highlights",
      "short_detail": "Key moments from the heated political debate have sparked nationwide discussions.",
      "long_detail": "The recent political debate featured several key moments that have ignited discussions across the country. Candidates clashed on issues such as healthcare, education, and climate change, with each side presenting their vision for the future. Analysts believe that these debates could significantly impact voter sentiment leading up to the election.",
      "trueVotes": 1,
      "falseVotes": 0,
      "reporter": "Sophie Chen",
      "date": "2025-08-14",
      "time": "07:00:00",
      "imageUrl": "/images/news/Comp01.jpeg"
    }
  ]
}